src/Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СтоимостьПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьПеремещения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Перемещение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.ОстаткиНаСкладах.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТовар.Товар КАК Товар,
		|	ПеремещениеТовар.Количество КАК Количество,
		|	ПеремещениеТовар.Ссылка.СкладОтправитель КАК СкладОтправитель,
		|	ЕСТЬNULL(СтоимостьПеремещенияСрезПоследних.Стоимость, 0) КАК СтоимостьПеремещения
		|ПОМЕСТИТЬ ТребуетсяСписать
		|ИЗ
		|	Документ.Перемещение.Товары КАК ПеремещениеТовар
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПеремещения.СрезПоследних(&Период, ) КАК СтоимостьПеремещенияСрезПоследних
		|		ПО ПеремещениеТовар.Ссылка.СкладОтправитель = СтоимостьПеремещенияСрезПоследних.СкладОтправитель
		|			И ПеремещениеТовар.Ссылка.СкладПолучатель = СтоимостьПеремещенияСрезПоследних.СкладПолучатель
		|ГДЕ
		|	ПеремещениеТовар.Ссылка = &ДокументПеремещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНаСкладахОстатки.Партия КАК Партия,
		|	ОстаткиНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиНаСкладахОстатки.СуммаОстаток КАК СтоимостьОстаток,
		|	ОстаткиНаСкладахОстатки.Организация КАК Организация
		|ПОМЕСТИТЬ ОстаткиПоПартиям
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСкладах.Остатки(
		|			&Период,
		|			(Номенклатура, Склад) В
		|				(ВЫБРАТЬ
		|					ТребуетсяСписать.Товар КАК Номенклатура,
		|					ТребуетсяСписать.СкладОтправитель КАК Склад
		|				ИЗ
		|					ТребуетсяСписать КАК ТребуетсяСписать)) КАК ОстаткиНаСкладахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТребуетсяСписать.Товар КАК Товар,
		|	ТребуетсяСписать.Количество КАК Количество,
		|	ОстаткиПоПартиям.Партия КАК Партия,
		|	ОстаткиПоПартиям.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиПоПартиям.СтоимостьОстаток КАК СтоимостьОстаток,
		|	ТребуетсяСписать.СтоимостьПеремещения КАК СтоимостьПеремещения,
		|	ОстаткиПоПартиям.Организация КАК Организация
		|ИЗ
		|	ТребуетсяСписать КАК ТребуетсяСписать
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоПартиям КАК ОстаткиПоПартиям
		|		ПО (ОстаткиПоПартиям.Номенклатура = ТребуетсяСписать.Товар)
		|ИТОГИ
		|	МИНИМУМ(Количество),
		|	СУММА(КоличествоОстаток),
		|	МИНИМУМ(СтоимостьПеремещения)
		|ПО
		|	Товар";
	
	Запрос.УстановитьПараметр("ДокументПеремещение", Ссылка);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТовар.Следующий() Цикл
		// Вставить обработку выборки ВыборкаТовар
		
		Если ВыборкаТовар.Количество > ВыборкаТовар.КоличествоОстаток Тогда
		
			Сообщить("Не достаточно товара " + ВыборкаТовар.Товар);
			
			Отказ = Истина;
		
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаТовар.Выбрать();
		
		ТребуетсяПереместить = ВыборкаТовар.Количество; 
		
		КСписанию = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() И ТребуетсяПереместить > 0 Цикл
			
			Если ТребуетсяПереместить > ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
				
				КСписанию =  ВыборкаДетальныеЗаписи.КоличествоОстаток;
				
				ТребуетсяПереместить = ТребуетсяПереместить - КСписанию;
				
			Иначе
				
				КСписанию = ТребуетсяПереместить;
				
				ТребуетсяПереместить = 0;
				
			КонецЕсли;
			
			Движение = Движения.ОстаткиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Партия = ВыборкаДетальныеЗаписи.Партия;
			Движение.Организация = ВыборкаДетальныеЗаписи.Организация; 
			Движение.Склад = СкладОтправитель;
			Движение.Номенклатура = ВыборкаТовар.Товар;
			Движение.Количество = КСписанию;
			
			СтоимостьКСписанию = ВыборкаДетальныеЗаписи.СтоимостьОстаток / ВыборкаДетальныеЗаписи.КоличествоОстаток * КСписанию;
			
			Движение.Сумма = СтоимостьКСписанию; 
			
			СтоимостьПеремещенияПозиции =  ВыборкаТовар.СтоимостьПеремещения / ВыборкаТовар.Количество();
			
			СтоимостьПеремещенияЕдиницыТовара = СтоимостьПеремещенияПозиции / ВыборкаТовар.Количество;
			
			СтоимостьПриемки = СтоимостьКСписанию + СтоимостьПеремещенияЕдиницыТовара * КСписанию; 
			
			Движение = Движения.ОстаткиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = Ссылка;
			Движение.Склад = СкладПолучатель;
			Движение.Организация = ВыборкаДетальныеЗаписи.Организация;
			Движение.Номенклатура = ВыборкаТовар.Товар;
			Движение.Количество = КСписанию;
			Движение.Сумма = СтоимостьПриемки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
